Autodesk.Revit.DB.PrintParameters.MaskCoincidentLines
Indicates whether to mask coincident lines when printing.
Since: 2015

Autodesk.Revit.DB.PrintParameters.ReplaceHalftoneWithThinLines
Indicates whether to replace halftone with thin lines when printing.

Autodesk.Revit.DB.PrintParameters.HideCropBoundaries
Indicates whether to hide crop boundaries when printing.

Autodesk.Revit.DB.PrintParameters.HideScopeBoxes
Indicates whether to hide scope boxes when printing.

Autodesk.Revit.DB.PrintParameters.HideUnreferencedViewTags
Indicates whether to hide unreferenced view tags when printing.

Autodesk.Revit.DB.PrintParameters.HideReforWorkPlanes
Indicates whether to hide reference/work planes when printing.

Autodesk.Revit.DB.PrintParameters.ViewLinksinBlue
Indicates whether to view links in blue when printing.

Autodesk.Revit.DB.PrintParameters.ColorDepth
The color depth type.

Autodesk.Revit.DB.PrintParameters.RasterQuality
The raster quality type.

Autodesk.Revit.DB.PrintParameters.HiddenLineViews
The hidden line views type.

Autodesk.Revit.DB.PrintParameters.Zoom
The zoom value to a percentage of the original size.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if current ZoomType is not Zoom type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown if input zoom value less than 1.

Autodesk.Revit.DB.PrintParameters.ZoomType
The zoom type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the input argument is out of range.

Autodesk.Revit.DB.PrintParameters.UserDefinedMarginY
The User defined Y value of offset from left bottom corner
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if PaperPlacement is not Margins and MarginType is not User defined type.

Autodesk.Revit.DB.PrintParameters.UserDefinedMarginX
The User defined X value of offset from left bottom corner.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if PaperPlacement is not Margins and MarginType is not User defined type.

Autodesk.Revit.DB.PrintParameters.MarginType
The print margin type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the input argument is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the PaperPlacement is not Margins type.

Autodesk.Revit.DB.PrintParameters.PaperPlacement
The paper placement type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the input argument is out of range.

Autodesk.Revit.DB.PrintParameters.PaperSource
The page source.
Remarks: User can select the candidate via Autodesk.Revit.DB.PrintManager.PaperSources and then
set the Page source of the Print Setting.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument is invalid for current printer.

Autodesk.Revit.DB.PrintParameters.PaperSize
The page size.
Remarks:
User can select the candidate via Autodesk.Revit.DB.PrintManager.PaperSizes and then
set the Page source of the Print Setting.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument is invalid for current printer.

Autodesk.Revit.DB.PrintParameters.PageOrientation
The Page Orientation of the Print Setting.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the input argument is out of range.

Autodesk.Revit.DB.PrintParameters
An object that contains settings used for printing the document.